# 2. Refine the Data

    "Data is messy"

We will be performing the following operation on our Maize  price to refine it

    -Remove e.g. remove redundant data from the data frame
    -Parse e.g. change date format

Other stuff you may need to do to refine are...

    -Missing e.g. Check for missing or incomplete data
    -Quality e.g. Check for duplicates, accuracy, unusual data
    -Convert e.g. free text to coded value
    -Calculate e.g. percentages, proportion
    -Merge e.g. first and surname for full name
    -Aggregate e.g. rollup by year, cluster by area
    -Filter e.g. exclude based on location
    -Sample e.g. extract a representative data
    -Summary e.g. show summary stats like mean

In [11]:
import pandas as pd
import numpy as np

prices_df=pd.read_excel("market_prices.xlsx")
prices_df.head()

    Market Product   Country        Date  Retail  Wholesale
0    Busia   Maize    Uganda  2018-01-02    2291       2034
1   Iringa   Maize  Tanzania  2018-01-02    2066       1859
2  Masindi   Maize    Uganda  2018-01-02    1783       1656
3  Kampala   Maize    Uganda  2018-01-02    2547       1834
4   Kabale   Maize    Uganda  2018-01-02    2547       1936

In [7]:
prices_df.dtypes

Market       object
Product      object
Country      object
Date         object
Retail        int64
Wholesale     int64
dtype: object

# drop redundant data 

drop the product column

In [12]:
prices_df.drop('Product', axis=1, inplace=True)
prices_df.head()

    Market   Country        Date  Retail  Wholesale
0    Busia    Uganda  2018-01-02    2291       2034
1   Iringa  Tanzania  2018-01-02    2066       1859
2  Masindi    Uganda  2018-01-02    1783       1656
3  Kampala    Uganda  2018-01-02    2547       1834
4   Kabale    Uganda  2018-01-02    2547       1936

In [13]:
prices_df.describe()

             Retail    Wholesale
count   3595.000000  3595.000000
mean    3622.277608  3123.170793
std     1564.016464  1337.805534
min        0.000000     0.000000
25%     2560.000000  2168.500000
50%     3295.000000  2790.000000
75%     4500.000000  3829.500000
max    17315.000000  7985.000000

In [75]:
prices_df[prices_df['Retail']==0].head()

    Market   Country        Date  Retail  Wholesale
17  Dodoma  Tanzania  2018-01-01       0       1820
27  Dodoma  Tanzania  2017-12-29       0       1842
58  Dodoma  Tanzania  2017-12-28       0       1859
76  Dodoma  Tanzania  2017-12-27       0       1837
80  Dodoma  Tanzania  2017-12-26       0       1789

In [29]:
len(prices_df[prices_df['Retail']==0])

125

#### Above shows most of Dodoma Market in Tanzania has does not have Retail prices

In [37]:
prices_df[prices_df['Wholesale']==0].head()

    Market      Country        Date  Retail  Wholesale
164    Yei  South Sudan  2017-12-19    5299          0
202    Yei  South Sudan  2017-12-18    5297          0
234    Yei  South Sudan  2017-12-15    5301          0
260    Yei  South Sudan  2017-12-14    5295          0
349    Yei  South Sudan  2017-12-11    5297          0

In [35]:
len(prices_df[prices_df['Wholesale']==0])

13

#### Most of Yei Market in South Sudan has no wholesale prices

In [25]:
prices_df[(prices_df['Retail']==0) &(prices_df['Wholesale']== 0)]

      Market   Country        Date  Retail  Wholesale
2443  Ruhuha    Rwanda  2017-08-29       0          0
2883  Dodoma  Tanzania  2017-08-05       0          0
2884   Busia    Uganda  2017-08-05       0          0

## Handling the zeros
Replace the zeros with a mean for example I replaced a zeros in a wholesale price in kenya with an avg of all wholesale prices for Kenya.

In [80]:
#Tanzania Retail Prices
Tz_mean=prices_df[(prices_df['Retail']!=0) &(prices_df['Country']== 'Tanzania')].Retail.mean()

#### Three markets in Rwanda, Tanzania and Uganda lacked both Reatil and Wholesale prices for 29th and 5th of August 2017 as seen above

## Countries and markets with the highest retail and wholesale prices

In [40]:
prices_df[prices_df['Retail']==max(prices_df['Retail'])]

     Market   Country        Date  Retail  Wholesale
622  Iringa  Tanzania  2017-11-27   17315       1649

In [41]:
prices_df[prices_df['Wholesale']==max(prices_df['Wholesale'])]

     Market  Country        Date  Retail  Wholesale
905  Gitega  Burundi  2017-11-13    8518       7985

### listed Kenyan markets

In [73]:
kenya=prices_df[prices_df.Country=="Kenya"]
kenya['Market'].unique()

array(['Kisumu', 'Nairobi', 'Mombasa', 'Nakuru', 'Makueni', 'Meru',
       'Eldoret', 'Machakos'], dtype=object)